[
  {
    "text": "At SNUC, we believe that a healthy mind and body go hand in hand. Through our state-of-the-art sports facilities and engaging fitness programs, we encourage students to stay active, build resilience, and prioritize well-being.\n\nThis \nhashtag\n#WorldHealthDay, let's commit to a healthier future together!",
    "image": "/images/linkedin_posts/img_1744129556098.jpg",
    "link": "No link"
  },
  {
    "text": "SNUC recognizes the vital role of the maritime sector in shaping our world. On National Maritime Day, we celebrate the seafarers who connect nations, transport goods, and drive global trade. Their dedication and resilience are essential to our interconnected world. \n\n\nhashtag\n#NationalMaritimeDay",
    "image": "/images/linkedin_posts/img_1744129557747.jpg",
    "link": "No link"
  },
  {
    "text": "Unlocking the future of trust! The Two-Day Workshop on \"Distributed Trust: Theory and Applications through Hedera Lens\" explored the power of Hedera Hashgraph, decentralized applications, and real-world blockchain innovations. \n\nWith expert-led discussions and hands-on sessions, attendees gained practical insights into trust management and DApp development.\n\n\nhashtag\n#DecentralizedFuture \nhashtag\n#HederaWorkshop \nhashtag\n#BlockchainInnovation \nhashtag\n#TrustTech",
    "image": "/images/linkedin_posts/img_1744129558815.jpg",
    "link": "No link"
  },
  {
    "text": "Congratulations to Irfan Ahmed, Aarav R Suriyanarayanan, and Navya Jain for securing 1st place in the prestigious Solvathon 2025! Their innovative multilingual AI bot is set to revolutionize healthcare communication at Apollo Hospitals. \n\nFrom 108 teams to the grand win, their dedication and skills led them to the top! \n\n\nhashtag\n#Solvathon",
    "image": "/images/linkedin_posts/img_1744129559902.jpg",
    "link": "No link"
  },
  {
    "text": "Celebrating strength, resilience, and inspiration at Shrishti 2025 – SNUC’s Women's Day celebration! 🌸✨ With empowering insights from Major Divya D and Dr. Navina Suresh, the event was a tribute to women who lead, inspire, and break barriers. From thought-provoking discussions to stories of perseverance, Shrishti 2025 was a testament to the power of women in every sphere. 💜\n\n\nhashtag\n#Shrishti'25",
    "image": "/images/linkedin_posts/img_1744129561305.jpg",
    "link": "No link"
  },
  {
    "text": "Some bonds don’t need words—just one letter to say it all. \n\nTo the ones who always stand by us, lift us up, and make life better—this Women’s Day, we celebrate you. \nTag the women who deserve a letter of appreciation & share your gratitude with \nhashtag\n#UpliftingTogether.\n\n\nhashtag\n#AccelerateHerForward \nhashtag\n#WomenForWomen \nhashtag\n#GratitudeInAction \nhashtag\n#LettersOfAppreciation \nhashtag\n#SisterhoodStrong",
    "image": "/images/linkedin_posts/img_1744129562377.jpg",
    "link": "No link"
  },
  {
    "text": "Admissions at Shiv Nadar University Chennai are open.\nWhether you dream of innovating with tech, diving into commerce, exploring data, or standing up for justice, we’ve got the perfect program for you.\nDon’t miss your chance to join a world-class campus where learning meets endless possibilities!\n\nhashtag\n#Admissions2024 \nhashtag\n#SNUChennai \nhashtag\n#FutureReady \nhashtag\n#CollegeGoals \nhashtag\n#DreamBig \nhashtag\n#LearnLeadSucceed",
    "image": "/images/linkedin_posts/img_1744129563770.jpg",
    "link": "No link"
  },
  {
    "text": "The Shiv Nadar School of Law is pleased to be organising the book launch of 'Foundations of Indian Contract Law' (Oxford University Press), co-edited by our Dean, Prof. Shivprasad Swaminathan, our Programme Advisor, Prof. Umakanth Varottil, Mr. Krishnaprasad KV and Mr. Niranjan V. We are honoured and privileged to have the book launched by Guests of Honour, Hon'ble Mr. Justice KV Vishwanathan and Dr. Abhishek Singhvi. We look forward to the event and to furthering cutting edge scholarship on all areas of law. \n\nFoundations of Indian Contract Law is an authoritative, critical commentary on Indian contract law. It comprises 24 chapters that examine the historical, philosophical, and comparative foundations of the Indian Contract Act 1872, the central doctrines and concepts of Indian contract law, the law relating to certain specific types of contracts, and a concluding chapter by Professor Hugh Beale. The book features contributions from 32 academics and practitioners from around the world. The book aims to influence the Indian courts’ approach to contract law, inform meaningful legislative reform and, more broadly, catalyse a culture of critical scholarship on Indian private law.",
    "image": "/images/linkedin_posts/img_1744129565116.jpg",
    "link": "No link"
  },
  {
    "text": "The Department of Commerce is proud to announce that our Bcom 1st and 2nd year students have successfully cleared the CA Foundation exam held in September 2024 by the Institute of Chartered Accountants of India. Congratulations on this outstanding achievement! \n\nhashtag\n#CAfoundation \nhashtag\n#snuc \nhashtag\n#shivnadaruniversitychennai",
    "image": "/images/linkedin_posts/img_1744129566482.jpg",
    "link": "No link"
  },
  {
    "text": "This semester, our 4th-year CSE IoT students had the incredible opportunity to attend a one-credit course on patent law led by Mr. Adheesh Nargolkar, a trailblazer in the field of intellectual property rights (IPR). Through real-world case studies, they delved into the nuances of patents, learning how they shape the tech landscape and drive innovation.\n\nhashtag\n#IPRInsights \nhashtag\n#ShivNadarUniversityChennai \nhashtag\n#TechAndInnovation \nhashtag\n#PatentLawLearning \nhashtag\n#CSEIoT",
    "image": "/images/linkedin_posts/img_1744129567842.jpg",
    "link": "No link"
  },
  {
    "text": "We are proud to announce that the following Bcom students have successfully cleared the CA Intermediate exam held in September 2024 by the Institute of Chartered Accountants of India. Congratulations on this outstanding achievement! \n\nhashtag\n#CAfoundation \nhashtag\n#snuc \nhashtag\n#shivnadaruniversitychennai",
    "image": "/images/linkedin_posts/img_1744129569202.jpg",
    "link": "No link"
  },
  {
    "text": "Wondering how to kick-start your journey at SNU Chennai? Get all the answers about our admission process — clear, simple, and just a step away from your bright future!\n\n\nhashtag\n#AdmissionsAtSNUC \nhashtag\n#FutureReady \nhashtag\n#AcademicExcellence",
    "image": "/images/linkedin_posts/img_1744129570552.jpg",
    "link": "No link"
  },
  {
    "text": "Unity in diversity begins with respect for all.’ Shiv Nadar University Chennai marked Anti-Ragging Week from 12th to 18th August 2024, fostering a safe and inclusive campus through awareness events, orientation sessions, and a collective pledge. \nhashtag\n#NoRagging \nhashtag\n#SafeCampus \nhashtag\n#SNUC",
    "image": "/images/linkedin_posts/img_1744129572006.jpg",
    "link": "No link"
  },
  {
    "text": "Gear up for an inspiring start! Join us on August 16th & 17th at the Justice Pratap Singh Auditorium for sessions with leaders from the Indian Army, top industry experts, and more. Embrace your new journey with impactful talks and sessions designed just for you!\n📅 Date: August 16-17\n📍 Venue: Justice Pratap Singh Auditorium\n\nhashtag\n#Shubharam2024 \nhashtag\n#FreshersOrientation \nhashtag\n#NewBeginnings \nhashtag\n#snuc",
    "image": "No image",
    "link": "No link"
  },
  {
    "text": "To the youth of SNUC, the successors of the world and the torchbearers of tomorrow. Guiding our young talent to become the leaders who lead from the front. Wishing them all the success on this International Youth Day!\"\n \nhashtag\n#internationalyouthday \nhashtag\n#YouthofIndia \nhashtag\n#SNUC \nhashtag\n#ShivNadarUniversity \nhashtag\n#ShivNadaUniversityChennai \nhashtag\n#college",
    "image": "/images/linkedin_posts/img_1744129579554.jpg",
    "link": "No link"
  }
]